импортировать клавиатуру
импорт pyautogui
время импорта
импортировать пиперклип
из deep_translator импортировать GoogleTranslator


определение OnOffFunc():
    глобальный включен
    если включено == "выкл":
        включено = "включено"
    еще:
        включить = "выключить"

деффу():
    глобальный текст
    глобальный язык
    глобальное включение
    если включено == "вкл":
        время сна (0,05)
        текст = pyperclip.paste()
        пытаться:
        если text[0] в символахRU:
            язык = "en"
        если text[0] в символахENG:
            язык = "ru"
        pyperclip.copy(GoogleTranslator(source='auto', target=lang).translate(text))
        print("Справились! foo")
        печать (текст)
        текст = ""
        кроме:
            print('Ошибка поиска символов')
    еще:
        print("не по сценарию")

текст = ""
язык = ""
включено = "выключено"

символыENG = ['q','w','e','r','t','y','u','i','o','p','a','s' ,'d','f','g','h','j','k','l','z','x','c','v','b',' п','м',
              «Q», «W», «E», «R», «T», «Y», «U», «I», «O», «P», «A», «S», «D». ','F','G','H','J','K','L','Z','X','C','V','B','N', 'М']
символыRU = ['й','ц','у','к','е','н','г','ш','щ','з','х','ъ' ,'ф','ы','в','а','п','р','о','л','д','ж','э','я',' ч','с','м','и','т','ь','б','ю',
             «Й», «Ц», «У», «К», «Е», «Н», «Г», «Ш», «Щ», «З», «Х», «Ъ», «Ф». ','Ы','В','А','П','Р','О','Л','Д','Ж','Э','Я','Ч', «С», «М», «И», «Т», «Ь», «Б», «Ю»,]

keyboard.add_hotkey('Ctrl + Alt', OnOffFunc)
keyboard.add_hotkey('Ctrl + C', foo)

print("Мягкий старт!")

keyboard.wait('Ctrl + Q')